<font size="2" face="Arial">Добрий день, {{username}}!<br><br>
    Ви зареєструвалися на сайті <a href="{{base_url}}">{{site_domain}}</a> для миттєвої оплати послуг.<br>
    <br>
    Логін: {{email}}<br>
    Пароль: {{password}}<br>
    <br>
    <br>
    Для підтвердження своєї адреси електронної пошти перейдіть за посиланням {{verify_link}}
    <br>
    <br>
    Якщо у вас виникли питання, ви можете звернутися до нашого контакт-центру:<br>
    тел.: <a href="tel:+380442474040">+38 (044) 247-40-40</a><br>
</font><br>
