<font size="2" face="Arial">Добрий день!<br><br>
    Вам було залишине повідомлення на сайті <a href="{{base_url}}">{{site_domain}}</a>.<br>
    Автор:<br>
    <br>
    Ім’я: {{username}}<br>
    Електронна пошта: {{email}}<br>
    Текст повідомлення: <br>
    <blockquote>{{text}}</blockquote>
    <br>
    <br>
    Якщо у вас виникли питання, ви можете звернутися до нашого контакт-центру:<br>
    тел.: <a href="tel:+380442388025">+38 (044) 238-80-25</a>, або <a href="tel:+380442388027">+38 (044) 238-80-27</a><br>
</font><br>
