<font size="2" face="Arial">Шановні користувачі!<br><br>
    В особистому кабінеті користувачеві сайту дозволяється додавати тільки ті об’єкти (адреси),
    які знаходяться в його володінні / користуванні, або за якими здійснюється оплата комунальних послуг за дорученням.
    <br>
    <br>
    Попереджаємо вас, що вчинення відповідних дій особами, які не мають відповідних прав,
    розцінюється як умисний збір інформації про інших осіб, що є порушенням законодавства України щодо захисту персональних даних.
    <br>
    <br>
    З найкращими побажаннями,<br>
    Адміністрація МДЛ!
</font><br>
