<font size="2" face="Arial">Добрий день!<br><br>
    На сайті <a href="{{ext_base_url}}">{{site_domain}}</a> була створена заявка на відновлення доступу до облікового запису ({{email}}).<br>
    Якщо цей запит створили не Ви, просто ігноруйте цей лист.<br>
    На жаль, у нашій системі не зареєстровано вказаної електронної адреси. Якщо Ви хочете використовувати нашу систему, Ви можете 
    зареєструватись за посиланням:<br>
    <a href="{{href}}">Реєстрація</a><br><br>
    Якщо у вас виникли питання, ви можете звернутися до нашого контакт-центру:<br>
    тел.: <a href="tel:+380442474040">+38 (044) 247-40-40</a><br>
</font><br>
