<font size="2" face="Arial">Добрий день, {{username}}!<br><br>
    На сайті <a href="{{base_url}}">{{site_domain}}</a> була створена заявка на відновлення доступу до Вашого облікового запису ({{email}}).<br>
    Якщо цей запит створили не Ви, або Ви не хочете змінювати Ваш пароль, просто ігноруйте це повідомлення.<br>
    Щоб змінити пароль перейдіть по посиланню нижче (або скопіюйте і вставте URL в свій браузер):<br>
    <a href="{{href}}">{{href}}</a><br><br>
    Якщо у вас виникли питання, ви можете звернутися до нашого контакт-центру:<br>
    тел.: <a href="tel:+380442474040">+38 (044) 247-40-40</a><br>
</font><br>
