<h1 class="big-title">Про ГіОЦ</h1>
<div class="main-page-text">
	Інформатизація України починається з інформатизації її столиці.Комунальне підприємство "Головний інформаційно - обчислювальний центр" (КП Г і О Ц), створене у 1963 році, спираючись на сучасні технології та кращий світовий досвід бере участь у інформатизації практично всіх галузей міського господарства. Підприємство надає інформаційно-обчислювальні послуги високого рівня, впроваджує та супроводжує сучасні програмні комплекси, забезпечуючи оперативну підтримка всіх змін у законодавстві, стійкість і надійність.Основоположний принцип роботи підприємства - максимум уваги до потреб кожного замовника за розумну ціну. 
</div>
<div class="page-subtitle">Пiдроздiли</div>
<div class="subtitle-item history">
	<a href="#" class="title">Коротка історія ГіОЦ</a>
	<div class="desc">Короткий анонс підрозділу увазі короткий опис розділу, що дозволяє користувачеві не робити зайвих переходів по сайту</div>
</div>
<div class="subtitle-item progress">
	<a href="#" class="title">Наші досягнення</a>
	<div class="desc">Короткий анонс підрозділу увазі короткий опис розділу, що дозволяє користувачеві не робити зайвих переходів по сайту</div>
</div>