<body>

<?php require_once(PROTECTED_DIR . '/layouts/navbar_inner.php'); ?>
<?php require_once(PROTECTED_DIR . '/scripts/breadcrumbs.php'); ?>

<div class="container">
    <content>
        <div class="text">
            <h1>Про нас</h1>
            <p>
                Основною метою діяльності Концерну – є відкриття та організація роботи сервісних центрів для обслуговування споживачів з усіх питань надання житлово-комунальних послуг. Створення мережі сервісних центрів – це, в першу чергу, необхідність стандартизувати роботу усіх точок прийому споживачів з питань ЖКГ, які на сьогодні працюють. Організація роботи центрів - це потреба часу та змін, які відбулися в системі визначення нових виконавців послуг. Створення таких центрів комунального сервісу сприятиме підвищенню та покращенню сфери обслуговування споживачів у частині отримання консультацій та інформації з усіх питань ЖКГ. Основний акцент сервісних центрів робиться на наданні професійних консультацій споживачам з питань житлово-комунального господарства. Новий сервіс також передбачає підвищення якості стандартів обслуговування, а саме:
                <ul>
                    <li>ввічливе ставлення до споживачів</li>
                    <li>швидкість та якість надання консультацій</li>
                    <li>створення комфортних умов очікування</li>
                    <li>мінімальні черги</li>
                    <li>Пріоритетним також буде створення нових форматів обслуговування:</li>
                    <li>можливість попереднього запису до спеціалістів за телефоном або через інтернет (економія часу й зусиль)</li>
                    <li>отримання інформації «не виходячи з дому» (по телефону, електронною поштою тощо)</li>
                    <li>Заступник генерального директора з адміністративно-господарської діяльності</li>
                </ul>
            </p>
        </div>
        <?php
            require_once(PROTECTED_DIR . '/scripts/map-form.php');
        ?>
    </content>
</div>
