<?php require_once(ROOT . '/protected/scripts/slider.php'); ?>
<h2>Тестова новина</h2>
<div class="main-page-text">
	Інформатизація України починається з інформатизації її столиці.Комунальне підприємство "Головний інформаційно - обчислювальний центр" (КП Г і О Ц),
    створене у 1963 році, спираючись на сучасні технології та кращий світовий досвід бере участь у інформатизації практично всіх галузей міського господарства.
    Підприємство надає інформаційно-обчислювальні послуги високого рівня, впроваджує та супроводжує сучасні програмні комплекси, забезпечуючи оперативну
    підтримка всіх змін у законодавстві, стійкість і надійність.
    <img src="http://placehold.it/350x100" alt="" style="float:left; margin:20px;">
    Основоположний принцип роботи підприємства - максимум уваги до потреб кожного замовника за розумну ціну.
    Інформатизація України починається з інформатизації її столиці.Комунальне підприємство "Головний інформаційно - обчислювальний центр" (КП Г і О Ц),
    створене у 1963 році, спираючись на сучасні технології та кращий світовий досвід бере участь у інформатизації практично всіх галузей міського господарства.
    <br><br>
    Підприємство надає інформаційно-обчислювальні послуги високого рівня, впроваджує та супроводжує сучасні програмні комплекси, забезпечуючи оперативну
    підтримка всіх змін у законодавстві, стійкість і надійність.
    <img src="http://placehold.it/350x100" alt="" style="float:right; margin:20px;">
    Інформатизація України починається з інформатизації її столиці.Комунальне підприємство "Головний інформаційно - обчислювальний центр" (КП Г і О Ц),
    створене у 1963 році, спираючись на сучасні технології та кращий світовий досвід бере участь у інформатизації практично всіх галузей міського господарства.
    Підприємство надає інформаційно-обчислювальні послуги високого рівня, впроваджує та супроводжує сучасні програмні комплекси, забезпечуючи оперативну
    підтримка всіх змін у законодавстві, стійкість і надійність.
<br><br><i>Джерело: <a target="_blank" href="https://google.com/">https://google.com/</a></i>
</div>
<div class="page-subtitle">Дивіться також:</div>
<div class="subtitle-item" style="padding:0;">
    <div style="float:left; margin-right:15px;">
        <img src="http://placehold.it/100x100" alt="">
    </div>
    <div>
        <a href="" class="title">Тестова новина</a>
        <div class="desc">Короткий анонс підрозділу увазі короткий опис розділу, що дозволяє користувачеві не робити зайвих переходів по сайту</div>
    </div>
    <div class="clear"></div>
</div>
